#!/usr/bin/env python
#coding:utf-8

# head 
# sidebar
# po

class FAKE:
    index = [

        [3, 322, "张沈鹏", "//323"],#顶部导航未读消息数 , 用户id, 用户昵称, 用户头像
        [ #左侧栏
            "//ewwr.jpg", #左边的背景图
            13142, #公司id
            "TECH2IPO", #公司名称
            "//xcvw.svg", #公司logo
            "新改变世界 , 我们见证未来", # 公司名称
            [
                ("weibo", "wewrw"), #后面的是id，完整的url用字符串拼接
                ("wx", "wewrw"), #是关注的二维码，参考DAO 
                ("twitter", "wewrw"), 
                ("xueqiu", "wewrw"), 
                ("mail", "232423@gmail.com"), 
            ],
            [       #标签组
                [
                    [
                        3232, #ID
                        "news", #频道短网址
                        "新闻资讯", #频道名称
                        32 #未读数
                    ],
                    [
                        322323,
                        "product", #频道短网址
                        "公司产品", #频道名称
                        28 #未读数
                    ],
                    [
                        23232,
                        "apply_show", #频道短网址
                        "苹果发布会", #频道名称
                        1 #未读数
                    ],
                ],
                [
                    [
                        323223,
                        "tech", #频道短网址
                        "科技媒体", #频道组
                        [
                             [
                                 3223,
                                "36kr", #频道短网址
                                "36KR", #频道名称
                                2 #未读数
                             ],   
                             [
                                322,
                                "huxiu", #频道短网址
                                "虎嗅网", #频道名称
                                12 #未读数
                             ],   
                        ]
                    ],
                    [
                        322,
                        "geek",
                        "极客社区", #频道组
                        [
                             [
                                322,
                                "v332ex", #频道短网址
                                "V2EX", #频道名称
                                2 #未读数
                             ],   
                             [
                                322,
                                "qdlt",
                                "前端乱炖", #频道短网址
                                12 #未读数
                             ],   
                        ]
                    ],
                ]
            ]
        ]
    ]

